const alarmEndpoint = "https://z5nl6jp7ra.execute-api.eu-central-1.amazonaws.com/Prod/api/alarm";

const locations = {
    "kyiv": [
        "Київська_область",
        "м_Біла_Церква_та_Білоцерківська_територіальна_громада",
        "м_Київ",
        "м_Васильків_та_Васильківська_територіальна_громада",
        "Вишгородська_територіальна_громада",
        "м_Бориспіль_та_Бориспільська_територіальна_громада",
        "Миронівська_територіальна_громада",
        "м_Фастів_та_Фастівська_територіальна_громада",
        "Макарівська_територіальна_громада",
        "м_Бровари_та_Броварська_територіальна_громада",
        "Подільський_район",
        "Сквирська_територіальна_громада",
        "м_Славутич_та_Славутицька_територіальна_громада",
        "Узинська_територіальна_громада",
        "Гребінківська_територіальна_громада",
    ],
    "khmelnytskyi": [
        "м_Старокостянтинів_та_Старокостянтинівська_територіальна_громада",
        "Хмельницька_область",
        "Шепетівський_район",
    ],
    "vinnytsia": [
        "Вінницька_область",
    ],
    "rivne": [
        "Рівненська_область",
        "Дубровицька_територіальна_громада",
        "Прилуцький_район",
        "Сарненський_район",
        "Вараський_район",
    ],
    "kharkiv": [
        "Харківська_область",
        "Харківський_район",
        "Ізюмський_район",
    ],
    "zhytomyr": [
        "Житомирська_область",
        "м_Коростень_та_Коростенська_територіальна_громада",
        "Житомирський_район",
        "Коростенський_район",
        "Радомишльська_територіальна_громада",
    ],
    "sumy": [
        "Сумська_область",
        "Сумський_район",
        "м_Суми_та_Сумська_територіальна_громада",
        "м_Конотоп_та_Конотопська_територіальна_громада",
        "Охтирський_район",
        "м_Шостка_та_Шосткинська_територіальна_громада",
    ],
    "dnipro": [
        "Дніпропетровська_область",
        "м_Нікополь_та_Нікопольська_територіальна_громада",
        "м_Кривий_Ріг_та_Криворізька_територіальна_громада",
        "м_Першотравенськ_та_Першотравенська_територіальна_громада",
        "м_Дніпро_та_Дніпровська_територіальна_громада",
        "Покровський_район",
        "Широківська_територіальна_громада",
        "Синельниківський_район",
    ],
    "donetsk": [
        "Краматорський_район",
        "Торецька_територіальна_громада",
        "Маріупольський_район",
        "м_Словянськ_та_Словянська_територіальна_громада",
        "Дружківська_територіальна_громада",
        "Святогірська_територіальна_громада",
        "Покровська_територіальна_громада",
        "Донецький_район",
    ],
    "ivano-frankivsk": [
        "ІваноФранківська_область",
    ],
    "cherkasy": [
        "м_Ватутіне_та_Ватутінська_територіальна_громада",
        "м_Черкаси_та_Черкаська_територіальна_громада",
        "Уманська_територіальна_громада",
        "Черкаська_область",
        "Золотоніський_район",
        "Жашківська_територіальна_громада",
        "Черкаський_район",
        "Смілянська_територіальна_громада",
        "Звенигородський_район",
        "Уманський_район",
    ],
    "odesa": [
        "Одеська_область",
        "Одеський_район",
        "Болградський_район",
        "Березівський_район",
        "БілгородДністровський_район",
        "Ізмаїльський_район",
        "Роздільнянський_район",
    ],
    "poltava": [
        "м_Полтава_та_Полтавська_територіальна_громада",
        "м_Пирятин_та_Пирятинська_територіальна_громада",
        "м_Кременчук_та_Кременчуцька_територіальна_громада",
        "Полтавська_область",
        "м_Лубни_та_Лубенська_територіальна_громада",
        "м_Миргород_та_Миргородська_територіальна_громада",
    ],
    "zaporizhzhya": [
        "Запорізька_область",
        "Запорізький_район",
        "м_Запоріжжя_та_Запорізька_територіальна_громада",
        "м_Мелітополь_та_Мелітопольська_територіальна_громада",
    ],
    "mykolaiv": [
        "м_Вознесенськ_та_Вознесенська_територіальна_громада",
        "м_Первомайськ_та_Первомайська_територіальна_громада",
        "м_Миколаїв_та_Миколаївська_територіальна_громада",
        "Костянтинівська_територіальна_громада",
        "Миколаївська_область",
        "Миколаївський_район",
    ],
    "ternopil": [
        "Тернопільська_область",
    ],
    "chernihiv": [
        "Чернігівська_область",
        "Ніжинський_район",
    ],
    "chernivtsi": [
        "Чернівецька_область",
    ],
    "lutsk": [
        "Волинська_область",
    ],
    "uzhhorod": [
        "Закарпатська_область"
    ],
    "kropyvnytskyi": [
        "Кропивницький_район",
        "Кіровоградська_область",
        "Голованівський_район",
    ],
    "lviv": [
        "Львівська_область",
    ],
};

export const getCorrectLocations = (data) => {
    const alarmedLocations = getAlarmedLocationsFromData(data);
    const citiesEntries = Object.entries(locations);
    return citiesEntries.reduce((correctAlarmedLocations, location) => {
        const isLocationAlarmed = location[1].reduce((isAlarmed, subLocation) => {
            if (isAlarmed === true) return true
            if (alarmedLocations.includes(subLocation)) return true
            return false
        }, false);

        if (isLocationAlarmed) return [...correctAlarmedLocations, location[0]];
        return correctAlarmedLocations
    }, [])
}

const getAlarmedLocationsFromData = (data) => {
    return data.reduce((acc, item) => {
        if (item.status === false) return acc
        return [...acc, item.cityName]
    }, [])
}

export const countAirstrikes = (data) => {
    const AMOUNT_SIZE = 4;

    const amount = data.reduce((acc, item) => acc + item.count, 0)
    let amountStr = amount.toString();
    while (amountStr.length < AMOUNT_SIZE) amountStr = "0" + amountStr
    return amountStr
}

export const getData = (setData) => {
    fetch(alarmEndpoint)
        .then(response => response.json())
        .then(data => setData(data))
}
